# Import Libraries

In [1]:
#standard imports
import numpy as np
import pandas as pd
#sql imports
from sqlalchemy import create_engine 
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Title Basics Normalization

In [2]:
#importing data from previous
data = 'Data/title_basics.csv.gz'
basics = pd.read_csv(data)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001.0,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [3]:
#creating list of genre from genres column
basics['genre_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001.0,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
136567,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
136568,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
136569,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,[Thriller]
136570,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"
136571,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,[Drama]

In [4]:
#exploding genres to seperate into new rows
exploded_genres=basics.explode('genre_split')
#saving all unique genres
unique_genres=sorted(exploded_genres['genre_split'].unique())

In [5]:
#creating Title Genres Table 
title_genres = exploded_genres[['tconst', 'genre_split']].copy()
title_genres.head()

      tconst genre_split
0  tt0035423      Comedy
0  tt0035423     Fantasy
0  tt0035423     Romance
1  tt0062336       Drama
2  tt0069049       Drama

In [6]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [7]:
#make new gnre id and remove old column
title_genres['genre_id'] = title_genres['genre_split'].map(genre_map)
title_genres = title_genres.drop(columns='genre_split')

In [8]:
#inspecting for success
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [9]:
#creating genres table 
genres = pd.DataFrame({'genre_name':genre_map.keys(),
                       'genre_id':genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [10]:
#removing unneccecary columns from basics
basics = basics.drop(columns=['originalTitle', 'isAdult', 'titleType', 'genres', 'genre_split', 'endYear'])
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0079644,November 1828,2001.0,140
4,tt0088751,The Naked Monster,2005.0,100

# Ratings Normalization

In [11]:
#import data
data = 'Data/title_ratings.csv.gz'
ratings = pd.read_csv(data)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       259
2  tt0000003            6.5      1737
3  tt0000004            5.6       174
4  tt0000005            6.2      2550

already all set

# TMDB normilization

In [12]:
#import data 
data = 'DATA/final_results_movie_00-01.csv.gz'
tmdb = pd.read_csv(data)
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.3,1158.0,PG-13
2,tt0079644,0.0,/79axmuH1UGkB7m72jjB9rPff9om.jpg,NaN,0.0,"[{'id': 10752, 'name': 'War'}]",NaN,285529.0,id,November 1828,...,0.0,140.0,"[{'english_name': 'Indonesian', 'iso_639_1': '...",Released,NaN,November 1828,0.0,0.0,0.0,NaN
3,tt0089067,0.0,NaN,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}]",NaN,210258.0,es,El día de los albañiles 2,...,0.0,90.0,"[{'english_name': 'Spanish', 'iso_639_1': 'es'...",Released,The laborers are back full of love and laughs.,El día de los albañiles 2,0.0,7.2,71.0,NaN
4,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.0,3.0,NaN

In [13]:
#deleting unneccesary columns
tmdb = tmdb[['id', 'revenue', 'budget', 'certification']]
tmdb.head()

         id     revenue      budget certification
0       NaN         NaN         NaN           NaN
1   11232.0  76019048.0  48000000.0         PG-13
2  285529.0         0.0         0.0           NaN
3  210258.0         0.0         0.0           NaN
4  151007.0         0.0         0.0           NaN

# Creating mySQL database

In [14]:
#connecting to mySQL
connection = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [15]:
#creating database
if database_exists(connection)==False:
    create_database(connection)
else: print('Database already exists')

Database already exists

# Adding Title Basics to my SQL database

In [16]:
#insecting info on basics dataframe
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 136572 entries, 0 to 136571
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          136572 non-null  object
 1   primaryTitle    136572 non-null  object
 2   startYear       136572 non-null  float64
 3   runtimeMinutes  136572 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [17]:
#creating variables for max length of primary key and movie title
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
#creating dictionary for basics schema
basic_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear": Float(),
    "runtimeMinutes": Integer()}

In [18]:
#saving title_basics to mySQL
basics.to_sql('title_basics',engine,dtype=basic_schema,if_exists='replace',index=False)
#setting tconst as our primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [19]:
#test query to ensure success
q = """ SELECT *
        FROM title_basics;"""

#running query
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0079644,November 1828,2001.0,140
4,tt0088751,The Naked Monster,2005.0,100
...,...,...,...,...
136567,tt9916170,The Rehearsal,2019.0,51
136568,tt9916190,Safeguard,2020.0,95
136569,tt9916270,Il talento del calabrone,2020.0,84
136570,tt9916362,Coven,2020.0,92
136571,tt9916538,Kuambil Lagi Hatiku,2019.0,123

# Adding Movie Ratings to mySQL

In [20]:
#cheking data info 
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1251094 entries, 0 to 1251093
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1251094 non-null  object
 1   averageRating  1251094 non-null  float64
 2   numVotes       1251094 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.6+ MB

In [21]:
#creating variable for length of primary key
key_len = ratings['tconst'].fillna('').map(len).max()
#creating dictionary for ratings schema
ratings_schema = {
      "tconst": String(key_len+1),
      "averageRating": Float(),
      "numVotes":Integer()
}

In [22]:
#saving ratings df
ratings.to_sql('title_ratings', engine, dtype=ratings_schema, if_exists='replace', index=False)
#setting tconst as primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [23]:
#test query
q = """ SELECT *
        FROM title_ratings;"""

pd.read_sql(q, engine)

            tconst  averageRating  numVotes
0        tt0000001            5.7      1924
1        tt0000002            5.8       259
2        tt0000003            6.5      1737
3        tt0000004            5.6       174
4        tt0000005            6.2      2550
...            ...            ...       ...
1251089  tt9916690            7.4         6
1251090  tt9916720            5.4       278
1251091  tt9916730            8.0         8
1251092  tt9916766            6.7        21
1251093  tt9916778            7.3        35

[1251094 rows x 3 columns]

# Saving TMDB data to mySQL

In [24]:
#checking info on tmdb data
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4510 entries, 0 to 4509
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             4508 non-null   float64
 1   revenue        4508 non-null   float64
 2   budget         4508 non-null   float64
 3   certification  864 non-null    object
dtypes: float64(3), object(1)
memory usage: 141.1+ KB

In [28]:
#creating variable for certification max string length
cert_len = tmdb['certification'].fillna('').map(len).max()
#creating dictionary for tmdb schema
tmdb_schema = {
     "id":Float(),
     "revenue":Float(),
     "budget":Float(),
     "certification": Text(cert_len+1)}

In [29]:
#saving TMDB data to my sq
tmdb.set_index('id').to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists='replace', index=True)

4510

In [30]:
#test query
q = """SELECT *
       FROM tmdb_data;"""

pd.read_sql(q, engine)

            id     revenue      budget certification
0          NaN         NaN         NaN          None
1      11232.0  76019000.0  48000000.0         PG-13
2     285529.0         0.0         0.0          None
3     210258.0         0.0         0.0          None
4     151007.0         0.0         0.0          None
...        ...         ...         ...           ...
4505   78417.0         0.0         0.0          None
4506  273575.0         0.0         0.0          None
4507  201706.0         0.0         0.0          None
4508  616033.0         0.0         0.0          None
4509  580269.0         0.0         0.0          None

[4510 rows x 4 columns]

# Importing Title_Genres and Genres Data to mySQL

In [31]:
#getting info on title_genre
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 237622 entries, 0 to 136571
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    237622 non-null  object
 1   genre_id  237622 non-null  int64
dtypes: int64(1), object(1)
memory usage: 5.4+ MB

Since title_genres is a joiner table, no primary key is needed

In [32]:
#saving data to mySQL
title_genres.to_sql('title_genres', engine, index=True)

237622

In [34]:
#getting info on genres
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [35]:
#saving genres to mySQL with genre_id as primary key
genres.set_index('genre_id').to_sql('genres', engine, index=True)

26

In [36]:
#test query on title genres
q = """SELECT *
       FROM title_genres;"""

pd.read_sql(q, engine)

         index     tconst  genre_id
0            0  tt0035423         5
1            0  tt0035423         9
2            0  tt0035423        18
3            1  tt0062336         7
4            2  tt0069049         7
...        ...        ...       ...
237617  136568  tt9916190        23
237618  136569  tt9916270        23
237619  136570  tt9916362         7
237620  136570  tt9916362        11
237621  136571  tt9916538         7

[237622 rows x 3 columns]

In [37]:
#test query on genres
q = """SELECT *
       FROM genres;"""

pd.read_sql(q, engine)

    genre_id  genre_name
0          0      Action
1          1       Adult
2          2   Adventure
3          3   Animation
4          4   Biography
5          5      Comedy
6          6       Crime
7          7       Drama
8          8      Family
9          9     Fantasy
10        10   Game-Show
11        11     History
12        12      Horror
13        13       Music
14        14     Musical
15        15     Mystery
16        16        News
17        17  Reality-TV
18        18     Romance
19        19      Sci-Fi
20        20       Short
21        21       Sport
22        22   Talk-Show
23        23    Thriller
24        24         War
25        25     Western